GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
			// 组内字节序号和残余数据初始化
			nByte	= 0;
			nLeft	= 0;
		}

		// 修改源串的指针和计数值
		pSrc++;
		nSrc++;
	}

	*pDst = 0;

	// 返回目标串长度
	return nDst;
}

//将每个ascii8位编码的Bit8去掉，依次将下7位编码的后几位逐次移到前面，形成新的8位编码。
u16 gsmencode7bit( const u8* pSrc, u8* pDst, u16 nSrcLength )
{
	u16 nSrc;
	u16 nDst;
	u16 nChar;
	u8	nLeft;

	// 计数值初始化
	nSrc	= 0;
	nDst	= 0;

	// 将源串每8个字节分为一组，压缩成7个字节
	// 循环该处理过程，直至源串被处理完
	// 如果分组不到8字节，也能正确处理
	while( nSrc < nSrcLength + 1 )
	{
		// 取源字符串的计数值的最低3位
		nChar = nSrc & 7;
		// 处理源串的每个字节
		if( nChar == 0 )
		{
			// 组内第一个字节，只是保存起来，待处理下一个字节时使用
			nLeft = *pSrc;
		}else
		{
			// 组内其它字节，将其右边部分与残余数据相加，得到一个目标编码字节
			*pDst = ( *pSrc << ( 8 - nChar ) ) | nLeft;
			// 将该字节剩下的左边部分，作为残余数据保存起来
			nLeft = *pSrc >> nChar;
			// 修改目标串的指针和计数值 pDst++;
			pDst++;
			nDst++;
		}

		// 修改源串的指针和计数值
		pSrc++; nSrc++;
	}

	// 返回目标串长度
	return nDst;
}

/*
   236446 gsm<
   SCA      08 91683108200245F3
   PDU TYPE 40
   OA       05 A1 0180F6
   PID标志  00
   DCS编码  08
   SCTS服务中心时间戳 31809090346323
   UDL长度  8C
   050003690301
   60A8597DFF0C60A85404987959579910768451C65B9E65F66D888D3960C551B559824E0BFF1A0031300151687403901A554665C559579910003500380028003200300031003272480029FF0C56FD51854E3B53EB56FD518565F6957F0031003600305206949FFF1A5DF24F7F75280031003000375206949FFF0C672A4F7F7528003500335206
 */
uint8_t sms_decode_pdu( char *pinfo, uint16_t size )
{
	char		*p = pinfo, *pdst = pinfo;
	char		c, pid;
	uint8_t		tbl[24] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 0, 0, 0, 0, 0, 0, 0xa, 0xb, 0xc, 0xd, 0xe, 0xf };
	uint16_t	len;
	uint8_t		pdu_type, msg_len;
	uint16_t	i;
	uint8_t		dcs;
	char		sender[32];
	uint8_t		decode_msg[180]; /*解码后的信息*/
	uint16_t	decode_msg_len;

/*将OCT数据转为HEX,两个字节拼成一个*/
	for( i = 0; i < size; i++ )
	{
		c		= tbl[*p++ - '0'] << 4;
		c		|= tbl[*p++ - '0'];
		*pdst++ = c;
	}
	p = pinfo;              /*重新定位到开始*/
/*SCA*/
	len = *p;               /*服务中心号码 Length (长度)+Tosca（服务中心类型）+Address（地址）*/
/*pdu类型*/
	p			+= ( len + 1 );
	pdu_type	= *p++;

/*OA来源地址*/
	len = *p++;             /*手机发送源地址 Length (长度,是数字个数)+Tosca（地址类型）+Address（地址）*/
	len = ( len + 1 ) >> 1; /*这里是数字位数，比如10086是5位 用三个字节表示*/
	p++;                    /*跳过地址类型*/
	for( i = 0; i < len; i++ )
	{
		sender[i] = *p++;   /*这里没有半字节交互，发送的时候还得换过来*/
	}

/*PID标志*/
	pid = *p++;
/*DCS编码*/
	dcs = *p++;
/*SCTS服务中心时间戳*/
	p += 7;

/*消息长度*/
	msg_len = *p++;
/*是否为长信息pdu_type 的bit6 UDHI=1*/
	if( pdu_type & 0x40 ) /*跳过长信息的头*/
	{
		len = *p;
		len++;
		p		+= len;
		msg_len -= len;
	}
	rt_kprintf( "\nSMS>PDU Type=%02x PID=%02x DCS=%02x MSG_LEN=%d", pdu_type, pid, dcs, msg_len );

	if( ( dcs & 0x0c ) == GSM_7BIT )
	{
		decode_msg_len = gsmdecode7bit( p, decode_msg, msg_len );
	}else if( ( dcs & 0x0c ) == GSM_UCS2 )
	{
		decode_msg_len = gsmdecodeucs2( p, decode_msg, msg_len );
	}else
	{
		memcpy( decode_msg, p, msg_len );
		decode_msg_len = msg_len;   /*简单拷贝即可*/
	}

	if( decode_msg_len )            /*对于不是合法的数据是不是直接返回0*/
	{
		decode_msg[decode_msg_len] = 0;
		jt808_sms_rx( sender, decode_msg, decode_msg_len );
	}
}

/*
   0:没有短信处理内容 非零值 有后续的处理

 */
uint8_t sms_rx_proc( char *pinfo, uint16_t size )
{
	int			st, index, count;
	char		buf[40];                                        /*160个OCT需要320byte*/
	uint32_t	tick = rt_tick_get( );

/*主动接收中心发来的信息*/
	if( strncmp( pinfo, "+CMTI: \"SM\",", 12 ) == 0 )           /*SM中满的时候，会存到ME中，如何读*/
	{
		if( sscanf( pinfo + 12, "%d", &index ) )
		{
			sms_index=index;
			rt_mb_send( &mb_sms_rx, 0x80000000 );   /*通知要读短信*/
			return 1;
		}
	}else if( strncmp( pinfo, "+CMGR: ", 7 ) == 0 )             /*+CMGR: 0,156,有可能是串口读的短信*/
	{
		if( sscanf( pinfo + 7, "%d,%d", &st, &count ) == 2 )    /*得到信息的长度*/
		{
			sms_state = SMS_WAIT_CMGR_DATA;
			return 1;
		}
	}else if( strncmp( pinfo, "+CMT:", 5 ) == 0 )               /*没有主动弹出的短信*/
	{
	}

	switch( sms_state )
	{
		case SMS_WAIT_CMGR_DATA:                                /*收到短信数据*/
			sms_decode_pdu( pinfo, size );                      /*解析数据*/
			sms_state	= SMS_WAIT_CMGR_OK;
			sms_tick	= tick;
			break;
		case SMS_WAIT_CMGR_OK:
			if( strncmp( pinfo, "OK", 2 ) == 0 )                /*读完了信息,删除*/
			{
				rt_mb_send( &mb_sms_rx, 0x40000000 );           /*通知要删除*/
				sms_state = SMS_IDLE;
			}
			break;
		case SMS_WAIT_CMGD_OK:
			if( strncmp( pinfo, "OK", 2 ) == 0 )                /*删除短信成功*/
			{
				sms_state = SMS_IDLE;
				sms_index=0;
			}
			break;
	}
/*
	if( tick - sms_tick > RT_TICK_PER_SECOND * 10 )
	{
		rt_kprintf( "\n靠,超时了" );
		sms_state = SMS_IDLE;
	}
*/
	return sms_state;
}

/*
   增加这个函数主要是中心有多个消息过来时候，如果处理不及时，会乱
   使用mailbox进行排队处理读取或删除短信
 */
void sms_proc( void )
{
	uint32_t	i;
	char		buf[40];
	rt_err_t	ret;

	T_GSM_STATE oldstate;

	if( sms_state != SMS_IDLE )
	{
		return;
	}
	/*检查是否出于AT命令就绪的状态*/
	if( gsm_state != GSM_TCPIP )
	{
		if( gsm_state != GSM_AT )
		{
			return;
		}
	}
	if( rt_mb_recv( &mb_sms_rx, &i, 0 ) != RT_EOK ) /*收到短信*/
	{
		return;
	}
	oldstate	= gsm_state;
	gsm_state	= GSM_AT_SEND;
	switch( i )
	{
		case 0x80000000:                        /*读信息0x80000000|index*/
			sprintf( buf, "AT+CMGR=%d\r\n", sms_index );
			ret = gsm_send( buf, RT_NULL, RT_NULL, RESP_TYPE_NONE, RT_TICK_PER_SECOND, 1 );
			break;
		case 0x40000000:                        /*删除信息0x40000000*/
			if( sms_index )
			{
				sprintf( buf, "AT+CMGD=%d\r\n", sms_index );
				ret			= gsm_send( buf, RT_NULL, RT_NULL, RESP_TYPE_NONE, RT_TICK_PER_SECOND, 1 );
				sms_state	= SMS_WAIT_CMGD_OK;
			}
			break;
	}
	gsm_state = oldstate;
}

#define RT_THREAD_ENTRY_GSM

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[512];
struct rt_thread thread_gsm;


/*
   状态转换，同时处理开机、登网、短信、TTS、录音等过程
 */
static void rt_thread_entry_gsm( void* parameter )
{
	while( 1 )
	{
		if( gsm_state == GSM_POWERON )
		{
			rt_thread_gsm_power_on( RT_NULL );
		}
		if( gsm_state == GSM_POWEROFF )
		{
			GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
			rt_thread_delay( RT_TICK_PER_SECOND * 5 ); /*延时5秒再启动*/
			gsm_state = GSM_IDLE;
		}

		if( gsm_state == GSM_GPRS )
		{
			rt_thread_gsm_gprs( RT_NULL );
		}

		if( gsm_state == GSM_SOCKET_PROC )
		{
			rt_thread_gsm_socket( RT_NULL );
		}

		sms_proc( );
		tts_proc( );    /*tts处理*/
		at_cmd_proc( ); /*at命令处理*/
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

#define RT_THREAD_ENTRY_GSM_RX

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_rx_stack[1024];
struct rt_thread thread_gsm_rx;


